RT-Thread/rt-thread/bsp/stm32/libraries/STM32H5xx_HAL/STM32H5xx_HAL_Driver/Inc/stm32h5xx_ll_bus.h
/** @defgroup BUS_LL_EC_APB1_GRP2_PERIPH  APB1 GRP2 PERIPH
  * @{
  */
#if defined(UART9)
#define LL_APB1_GRP2_PERIPH_ALL            0x0080022BU
#else
#define LL_APB1_GRP2_PERIPH_ALL            0x00000228U
#endif /* UART9 */
#if defined(UART9)
#define LL_APB1_GRP2_PERIPH_UART9          RCC_APB1HENR_UART9EN
#endif /* UART9 */
#if defined(UART12)
#define LL_APB1_GRP2_PERIPH_UART12         RCC_APB1HENR_UART12EN
#endif /* UART12*/
#define LL_APB1_GRP2_PERIPH_DTS            RCC_APB1HENR_DTSEN
#define LL_APB1_GRP2_PERIPH_LPTIM2         RCC_APB1HENR_LPTIM2EN
#define LL_APB1_GRP2_PERIPH_FDCAN          RCC_APB1HENR_FDCANEN
#if defined(UCPD1)
#define LL_APB1_GRP2_PERIPH_UCPD1          RCC_APB1HENR_UCPD1EN
#endif /* UCPD1 */
/**
  * @}
  */

/** @defgroup BUS_LL_EC_APB2_GRP1_PERIPH  APB2 GRP1 PERIPH
  * @{
  */
#if defined(TIM8)
#define LL_APB2_GRP1_PERIPH_ALL            0x017F7800U
#else
#define LL_APB2_GRP1_PERIPH_ALL            0x01005800U
#endif /* TIM8 */
#define LL_APB2_GRP1_PERIPH_TIM1           RCC_APB2ENR_TIM1EN
#define LL_APB2_GRP1_PERIPH_SPI1           RCC_APB2ENR_SPI1EN
#if defined(TIM8)
#define LL_APB2_GRP1_PERIPH_TIM8           RCC_APB2ENR_TIM8EN
#endif /* TIM8 */
#define LL_APB2_GRP1_PERIPH_USART1         RCC_APB2ENR_USART1EN
#if defined(TIM15)
#define LL_APB2_GRP1_PERIPH_TIM15          RCC_APB2ENR_TIM15EN
#endif /* TIM15 */
#if defined(TIM16)
#define LL_APB2_GRP1_PERIPH_TIM16          RCC_APB2ENR_TIM16EN
#endif /* TIM16 */
#if defined(TIM17)
#define LL_APB2_GRP1_PERIPH_TIM17          RCC_APB2ENR_TIM17EN
#endif /* TIM17 */
#if defined(SPI4)
#define LL_APB2_GRP1_PERIPH_SPI4           RCC_APB2ENR_SPI4EN
#endif /* SPI4 */
#if defined(SPI6)
#define LL_APB2_GRP1_PERIPH_SPI6           RCC_APB2ENR_SPI6EN
#endif /* SPI6 */
#if defined(SAI1)
#define LL_APB2_GRP1_PERIPH_SAI1           RCC_APB2ENR_SAI1EN
#endif /* SAI1 */
#if defined(SAI2)
#define LL_APB2_GRP1_PERIPH_SAI2           RCC_APB2ENR_SAI2EN
#endif /* SAI2 */
#define LL_APB2_GRP1_PERIPH_USB            RCC_APB2ENR_USBEN
/**
  * @}
  */

/** @defgroup BUS_LL_EC_APB3_GRP1_PERIPH  APB3 GRP1 PERIPH
  * @{
  */
#if defined(SPI5)
#define LL_APB3_GRP1_PERIPH_ALL           0x0030F9E2U
#else
#define LL_APB3_GRP1_PERIPH_ALL           0x00200A42U
#endif /* SPI5 */
#define LL_APB3_GRP1_PERIPH_SBS           RCC_APB3ENR_SBSEN
#if defined(SPI5)
#define LL_APB3_GRP1_PERIPH_SPI5          RCC_APB3ENR_SPI5EN
#endif /* SPI5 */
#define LL_APB3_GRP1_PERIPH_LPUART1       RCC_APB3ENR_LPUART1EN
#if defined(I2C3)
#define LL_APB3_GRP1_PERIPH_I2C3          RCC_APB3ENR_I2C3EN
#endif /* I2C3 */
#if defined(I2C4)
#define LL_APB3_GRP1_PERIPH_I2C4          RCC_APB3ENR_I2C4EN
#endif /* I2C4 */
#if defined(I3C2)
#define LL_APB3_GRP1_PERIPH_I3C2          RCC_APB3ENR_I3C2EN
#endif /* I3C2 */
#define LL_APB3_GRP1_PERIPH_LPTIM1        RCC_APB3ENR_LPTIM1EN
#if defined(LPTIM3)
#define LL_APB3_GRP1_PERIPH_LPTIM3        RCC_APB3ENR_LPTIM3EN
#endif /* LPTIM3 */
#if defined(LPTIM4)
#define LL_APB3_GRP1_PERIPH_LPTIM4        RCC_APB3ENR_LPTIM4EN
#endif /* LPTIM4 */
#if defined(LPTIM5)
#define LL_APB3_GRP1_PERIPH_LPTIM5        RCC_APB3ENR_LPTIM5EN
#endif /* LPTIM5 */
#if defined(LPTIM6)
#define LL_APB3_GRP1_PERIPH_LPTIM6        RCC_APB3ENR_LPTIM6EN
#endif /* LPTIM6 */
#define LL_APB3_GRP1_PERIPH_VREF          RCC_APB3ENR_VREFEN
#define LL_APB3_GRP1_PERIPH_RTCAPB        RCC_APB3ENR_RTCAPBEN
/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/* Exported functions --------------------------------------------------------*/
/** @defgroup BUS_LL_Exported_Functions BUS Exported Functions
  * @{
  */

/** @defgroup BUS_LL_EF_AHBx AHBx Branch
  * @{
  */
/**
  * @brief  Disable of AHBx Clock Branch
  * @rmtoll CFGR2    AHB1DIS     LL_AHB_DisableClock\n
  *         CFGR2    AHB2DIS     LL_AHB_DisableClock\n
  *         CFGR2    AHB4DIS     LL_AHB_DisableClock
  * @param  AHBx This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB_BRANCH_CLK_AHB1
  *         @arg @ref LL_AHB_BRANCH_CLK_AHB2
  *         @arg @ref LL_AHB_BRANCH_CLK_AHB4 (*)
  *
  *  (*)  : Not available for all stm32h5xxxx family lines.
  * @retval None
  */
__STATIC_INLINE void LL_AHB_DisableClock(uint32_t AHBx)
{
  SET_BIT(RCC->CFGR2, AHBx);
}

/**
  * @brief  Enable of AHBx Clock Branch
  * @rmtoll CFGR2    AHB1DIS     LL_AHB_EnableClock\n
  *         CFGR2    AHB2DIS     LL_AHB_EnableClock\n
  *         CFGR2    AHB4DIS     LL_AHB_EnableClock
  * @param  AHBx This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB_BRANCH_CLK_AHB1
  *         @arg @ref LL_AHB_BRANCH_CLK_AHB2
  *         @arg @ref LL_AHB_BRANCH_CLK_AHB4 (*)
  *
  *  (*)  : Not available for all stm32h5xxxx family lines.
  * @retval None
  */
__STATIC_INLINE void LL_AHB_EnableClock(uint32_t AHBx)
{
  __IO uint32_t tmpreg;
  CLEAR_BIT(RCC->CFGR2, AHBx);
  /* Delay after AHBx clock branch enabling */
  tmpreg = READ_BIT(RCC->CFGR2, AHBx);
  (void)tmpreg;
}

/**
  * @brief  Check if AHBx clock branch is disabled or not
  * @rmtoll CFGR2    AHB1DIS     LL_AHB_IsDisabledClock\n
  *         CFGR2    AHB2DIS     LL_AHB_IsDisabledClock\n
  *         CFGR2    AHB4DIS     LL_AHB_IsDisabledClock
  * @param  AHBx This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB_BRANCH_CLK_AHB1
  *         @arg @ref LL_AHB_BRANCH_CLK_AHB2
  *         @arg @ref LL_AHB_BRANCH_CLK_AHB4 (*)
  *
  *  (*)  : Not available for all stm32h5xxxx family lines.
  * @retval State of AHBx bus (1 or 0).
  */
__STATIC_INLINE uint32_t LL_AHB_IsDisabledClock(uint32_t AHBx)
{
  return ((READ_BIT(RCC->CFGR2, AHBx) == AHBx) ? 1UL : 0UL);
}

/**
  * @}
  */

/** @defgroup BUS_LL_EF_APBx APBx Branch
  * @{
  */
/**
  * @brief  Disable APBx Clock Branch
  * @rmtoll CFGR2    APB1DIS     LL_APB_DisableClock\n
  *         CFGR2    APB2DIS     LL_APB_DisableClock\n
  *         CFGR2    APB3DIS     LL_APB_DisableClock
  * @param  APBx This parameter can be a combination of the following values:
  *         @arg @ref LL_APB_BRANCH_CLK_APB1
  *         @arg @ref LL_APB_BRANCH_CLK_APB2
  *         @arg @ref LL_APB_BRANCH_CLK_APB3
  * @retval None
  */
__STATIC_INLINE void LL_APB_DisableClock(uint32_t APBx)
{
  SET_BIT(RCC->CFGR2, APBx);
}

/**
  * @brief  Enable of APBx Clock Branch
  * @rmtoll CFGR2    APB1DIS     LL_APB_EnableClock\n
  *         CFGR2    APB2DIS     LL_APB_EnableClock\n
  *         CFGR2    APB3DIS     LL_APB_EnableClock
  * @param  APBx This parameter can be a combination of the following values:
  *         @arg @ref LL_APB_BRANCH_CLK_APB1
  *         @arg @ref LL_APB_BRANCH_CLK_APB2
  *         @arg @ref LL_APB_BRANCH_CLK_APB3
  * @retval None
  */
__STATIC_INLINE void LL_APB_EnableClock(uint32_t APBx)
{
  __IO uint32_t tmpreg;
  CLEAR_BIT(RCC->CFGR2, APBx);
  /* Delay after APBx clock branch enabling */
  tmpreg = READ_BIT(RCC->CFGR2, APBx);
  (void)tmpreg;
}

/**
  * @brief  Check if APBx clock branch is disabled or not
  * @rmtoll CFGR2    APB1DIS     LL_APB_IsDisabledClock\n
  *         CFGR2    APB2DIS     LL_APB_IsDisabledClock\n
  *         CFGR2    APB3DIS     LL_APB_IsDisabledClock
  * @param  APBx This parameter can be a combination of the following values:
  *         @arg @ref LL_APB_BRANCH_CLK_APB1
  *         @arg @ref LL_APB_BRANCH_CLK_APB2
  *         @arg @ref LL_APB_BRANCH_CLK_APB3
  * @retval State of APBx bus (1 or 0).
  */
__STATIC_INLINE uint32_t LL_APB_IsDisabledClock(uint32_t APBx)
{
  return ((READ_BIT(RCC->CFGR2, APBx) == APBx) ? 1UL : 0UL);
}

/**
  * @}
  */

/**
  * @}
  */

