RT-Thread/rt-thread/bsp/stm32/libraries/STM32H5xx_HAL/STM32H5xx_HAL_Driver/Inc/stm32h5xx_ll_bus.h
/**
  * @brief  Disable AHB4 peripherals clock.
  * @rmtoll AHB4ENR  OTFDEC1EN       LL_AHB4_GRP1_DisableClock\n
  *         AHB4ENR  SDMMC1EN        LL_AHB4_GRP1_DisableClock\n
  *         AHB4ENR  SDMMC2EN        LL_AHB4_GRP1_DisableClock\n
  *         AHB4ENR  FMCEN           LL_AHB4_GRP1_DisableClock\n
  *         AHB4ENR  OCTOSPI1EN      LL_AHB4_GRP1_DisableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB4_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB4_GRP1_PERIPH_OTFDEC
  *         @arg @ref LL_AHB4_GRP1_PERIPH_SDMMC1
  *         @arg @ref LL_AHB4_GRP1_PERIPH_SDMMC2
  *         @arg @ref LL_AHB4_GRP1_PERIPH_FMC
  *         @arg @ref LL_AHB4_GRP1_PERIPH_OSPI1
  * @retval None
  */
__STATIC_INLINE void LL_AHB4_GRP1_DisableClock(uint32_t Periphs)
{
  CLEAR_BIT(RCC->AHB4ENR, Periphs);
}

/**
  * @brief  Force AHB4 peripherals reset.
  * @rmtoll AHB4RSTR  OTFDEC1RST      LL_AHB4_GRP1_ForceReset\n
  *         AHB4RSTR  SDMMC1RST       LL_AHB4_GRP1_ForceReset\n
  *         AHB4RSTR  SDMMC2RST       LL_AHB4_GRP1_ForceReset\n
  *         AHB4RSTR  FMCRST          LL_AHB4_GRP1_ForceReset\n
  *         AHB4RSTR  OCTOSPI1RST     LL_AHB4_GRP1_ForceReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB4_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB4_GRP1_PERIPH_OTFDEC
  *         @arg @ref LL_AHB4_GRP1_PERIPH_SDMMC1
  *         @arg @ref LL_AHB4_GRP1_PERIPH_SDMMC2
  *         @arg @ref LL_AHB4_GRP1_PERIPH_FMC
  *         @arg @ref LL_AHB4_GRP1_PERIPH_OSPI1
  * @retval None
  */
__STATIC_INLINE void LL_AHB4_GRP1_ForceReset(uint32_t Periphs)
{
  SET_BIT(RCC->AHB4RSTR, Periphs);
}

/**
  * @brief  Release AHB4 peripherals reset.
  * @rmtoll AHB4RSTR  OTFDEC1RST        LL_AHB4_GRP1_ReleaseReset\n
  *         AHB4RSTR  SDMMC1RST         LL_AHB4_GRP1_ReleaseReset\n
  *         AHB4RSTR  SDMMC2RST         LL_AHB4_GRP1_ReleaseReset\n
  *         AHB4RSTR  FMCRST            LL_AHB4_GRP1_ReleaseReset\n
  *         AHB4RSTR  OCTOSPI1RST       LL_AHB4_GRP1_ReleaseReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB4_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB4_GRP1_PERIPH_OTFDEC
  *         @arg @ref LL_AHB4_GRP1_PERIPH_SDMMC1
  *         @arg @ref LL_AHB4_GRP1_PERIPH_SDMMC2
  *         @arg @ref LL_AHB4_GRP1_PERIPH_FMC
  *         @arg @ref LL_AHB4_GRP1_PERIPH_OSPI1
  * @retval None
  */
__STATIC_INLINE void LL_AHB4_GRP1_ReleaseReset(uint32_t Periphs)
{
  CLEAR_BIT(RCC->AHB4RSTR, Periphs);
}

/**
  * @brief  Enable AHB4 peripheral clocks in Sleep mode
  * @rmtoll AHB4LPENR  OTFDEC1LPEN       LL_AHB4_GRP1_EnableClockSleep\n
  *         AHB4LPENR  SDMMC1LPEN        LL_AHB4_GRP1_EnableClockSleep\n
  *         AHB4LPENR  SDMMC2LPEN        LL_AHB4_GRP1_EnableClockSleep\n
  *         AHB4LPENR  FMCLPEN           LL_AHB4_GRP1_EnableClockSleep\n
  *         AHB4LPENR  OCTOSPI1LPEN      LL_AHB4_GRP1_EnableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB4_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB4_GRP1_PERIPH_OTFDEC
  *         @arg @ref LL_AHB4_GRP1_PERIPH_SDMMC1
  *         @arg @ref LL_AHB4_GRP1_PERIPH_SDMMC2
  *         @arg @ref LL_AHB4_GRP1_PERIPH_FMC
  *         @arg @ref LL_AHB4_GRP1_PERIPH_OSPI1
  * @retval None
  */
__STATIC_INLINE void LL_AHB4_GRP1_EnableClockSleep(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCC->AHB4LPENR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->AHB4LPENR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if AHB4 peripheral clocks in Sleep mode is enabled or not
  * @rmtoll AHB4LPENR  OTFDEC1LPEN       LL_AHB4_GRP1_IsEnabledClockSleep\n
  *         AHB4LPENR  SDMMC1LPEN        LL_AHB4_GRP1_IsEnabledClockSleep\n
  *         AHB4LPENR  SDMMC2LPEN        LL_AHB4_GRP1_IsEnabledClockSleep\n
  *         AHB4LPENR  FMCLPEN           LL_AHB4_GRP1_IsEnabledClockSleep\n
  *         AHB4LPENR  OCTOSPI1LPEN      LL_AHB4_GRP1_IsEnabledClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB4_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB4_GRP1_PERIPH_OTFDEC
  *         @arg @ref LL_AHB4_GRP1_PERIPH_SDMMC1
  *         @arg @ref LL_AHB4_GRP1_PERIPH_SDMMC2
  *         @arg @ref LL_AHB4_GRP1_PERIPH_FMC
  *         @arg @ref LL_AHB4_GRP1_PERIPH_OSPI1
  * @retval State of Periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_AHB4_GRP1_IsEnabledClockSleep(uint32_t Periphs)
{
  return ((READ_BIT(RCC->AHB4LPENR, Periphs) == Periphs) ? 1UL : 0UL);
}

/**
  * @brief  Disable AHB4 peripheral clocks in Sleep and Stop modes
  * @rmtoll AHB4LPENR  OTFDEC1LPEN       LL_AHB4_GRP1_DisableClockSleep\n
  *         AHB4LPENR  SDMMC1LPEN        LL_AHB4_GRP1_DisableClockSleep\n
  *         AHB4LPENR  SDMMC2LPEN        LL_AHB4_GRP1_DisableClockSleep\n
  *         AHB4LPENR  FMCLPEN           LL_AHB4_GRP1_DisableClockSleep\n
  *         AHB4LPENR  OCTOSPI1LPEN      LL_AHB4_GRP1_DisableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB4_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB4_GRP1_PERIPH_OTFDEC
  *         @arg @ref LL_AHB4_GRP1_PERIPH_SDMMC1
  *         @arg @ref LL_AHB4_GRP1_PERIPH_SDMMC2
  *         @arg @ref LL_AHB4_GRP1_PERIPH_FMC
  *         @arg @ref LL_AHB4_GRP1_PERIPH_OSPI1
  * @retval None
  */
__STATIC_INLINE void LL_AHB4_GRP1_DisableClockSleep(uint32_t Periphs)
{
  CLEAR_BIT(RCC->AHB4LPENR, Periphs);
}

/**
  * @}
  */
#endif /* AHB4PERIPH_BASE */

/** @defgroup BUS_LL_EF_APB1 APB1 Peripherals
  * @{
  */

/**
  * @brief  Enable APB1 peripherals clock.
  * @rmtoll APB1LENR     TIM2EN        LL_APB1_GRP1_EnableClock\n
  *         APB1LENR     TIM3EN        LL_APB1_GRP1_EnableClock\n
  *         APB1LENR     TIM4EN        LL_APB1_GRP1_EnableClock\n
  *         APB1LENR     TIM5EN        LL_APB1_GRP1_EnableClock\n
  *         APB1LENR     TIM6EN        LL_APB1_GRP1_EnableClock\n
  *         APB1LENR     TIM7EN        LL_APB1_GRP1_EnableClock\n
  *         APB1LENR     TIM12EN       LL_APB1_GRP1_EnableClock\n
  *         APB1LENR     TIM13EN       LL_APB1_GRP1_EnableClock\n
  *         APB1LENR     TIM14EN       LL_APB1_GRP1_EnableClock\n
  *         APB1LENR     WWDGEN        LL_APB1_GRP1_EnableClock\n
  *         APB1LENR     SPI2EN        LL_APB1_GRP1_EnableClock\n
  *         APB1LENR     SPI3EN        LL_APB1_GRP1_EnableClock\n
  *         APB1LENR     USART2EN      LL_APB1_GRP1_EnableClock\n
  *         APB1LENR     USART3EN      LL_APB1_GRP1_EnableClock\n
  *         APB1LENR     UART4EN       LL_APB1_GRP1_EnableClock\n
  *         APB1LENR     UART5EN       LL_APB1_GRP1_EnableClock\n
  *         APB1LENR     I2C1EN        LL_APB1_GRP1_EnableClock\n
  *         APB1LENR     I2C2EN        LL_APB1_GRP1_EnableClock\n
  *         APB1LENR     I3C1EN        LL_APB1_GRP1_EnableClock\n
  *         APB1LENR     CRSEN         LL_APB1_GRP1_EnableClock\n
  *         APB1LENR     USART6EN      LL_APB1_GRP1_EnableClock\n
  *         APB1LENR     USART10EN     LL_APB1_GRP1_EnableClock\n
  *         APB1LENR     USART11EN     LL_APB1_GRP1_EnableClock\n
  *         APB1LENR     CECEN         LL_APB1_GRP1_EnableClock\n
  *         APB1LENR     UART7EN       LL_APB1_GRP1_EnableClock\n
  *         APB1LENR     UART8EN       LL_APB1_GRP1_EnableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM2
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM3
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM4 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM5 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM6
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM7
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM12 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM13 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM14 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_WWDG
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI2
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI3
  *         @arg @ref LL_APB1_GRP1_PERIPH_OPAMP (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_COMP  (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART2
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART3
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART4 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART5 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C2
  *         @arg @ref LL_APB1_GRP1_PERIPH_I3C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_CRS
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART6 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART10 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART11 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_CEC (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART7 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART8 (*)
  *
  *  (*)  : Not available for all stm32h5xxxx family lines.
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP1_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCC->APB1LENR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->APB1LENR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Enable APB1 peripherals clock.
  * @rmtoll APB1HENR     UART9EN        LL_APB1_GRP2_EnableClock\n
  *         APB1HENR     UART12EN       LL_APB1_GRP2_EnableClock\n
  *         APB1HENR     DTSEN          LL_APB1_GRP2_EnableClock\n
  *         APB1HENR     LPTIM2EN       LL_APB1_GRP2_EnableClock\n
  *         APB1HENR     FDCANEN        LL_APB1_GRP2_EnableClock\n
  *         APB1HENR     FDCANEN        LL_APB1_GRP2_EnableClock\n
  *         APB1HENR     UCPD1EN        LL_APB1_GRP2_EnableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP2_PERIPH_ALL
  *         @arg @ref LL_APB1_GRP2_PERIPH_UART9 (*)
  *         @arg @ref LL_APB1_GRP2_PERIPH_UART12 (*)
  *         @arg @ref LL_APB1_GRP2_PERIPH_DTS
  *         @arg @ref LL_APB1_GRP2_PERIPH_LPTIM2
  *         @arg @ref LL_APB1_GRP2_PERIPH_FDCAN
  *         @arg @ref LL_APB1_GRP2_PERIPH_UCPD1
  *
  *  (*)  : Not available for all stm32h5xxxx family lines.
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP2_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCC->APB1HENR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->APB1HENR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if APB1 peripheral clock is enabled or not
  * @rmtoll APB1LENR     TIM2EN        LL_APB1_GRP1_IsEnabledClock\n
  *         APB1LENR     TIM3EN        LL_APB1_GRP1_IsEnabledClock\n
  *         APB1LENR     TIM4EN        LL_APB1_GRP1_IsEnabledClock\n
  *         APB1LENR     TIM5EN        LL_APB1_GRP1_IsEnabledClock\n
  *         APB1LENR     TIM6EN        LL_APB1_GRP1_IsEnabledClock\n
  *         APB1LENR     TIM7EN        LL_APB1_GRP1_IsEnabledClock\n
  *         APB1LENR     WWDGEN        LL_APB1_GRP1_IsEnabledClock\n
  *         APB1LENR     SPI2EN        LL_APB1_GRP1_IsEnabledClock\n
  *         APB1LENR     SPI3EN        LL_APB1_GRP1_IsEnabledClock\n
  *         APB1LENR     USART2EN      LL_APB1_GRP1_IsEnabledClock\n
  *         APB1LENR     USART3EN      LL_APB1_GRP1_IsEnabledClock\n
  *         APB1LENR     UART4EN       LL_APB1_GRP1_IsEnabledClock\n
  *         APB1LENR     UART5EN       LL_APB1_GRP1_IsEnabledClock\n
  *         APB1LENR     I2C1EN        LL_APB1_GRP1_IsEnabledClock\n
  *         APB1LENR     I2C2EN        LL_APB1_GRP1_IsEnabledClock\n
  *         APB1LENR     I3C1EN        LL_APB1_GRP1_IsEnabledClock\n
  *         APB1LENR     CRSEN         LL_APB1_GRP1_IsEnabledClock\n
  *         APB1LENR     USART6EN      LL_APB1_GRP1_IsEnabledClock\n
  *         APB1LENR     USART10EN     LL_APB1_GRP1_IsEnabledClock\n
  *         APB1LENR     USART11EN     LL_APB1_GRP1_IsEnabledClock\n
  *         APB1LENR     CECEN         LL_APB1_GRP1_IsEnabledClock\n
  *         APB1LENR     UART7EN       LL_APB1_GRP1_IsEnabledClock\n
  *         APB1LENR     UART8EN       LL_APB1_GRP1_IsEnabledClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM2
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM3
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM4 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM5 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM6
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM7
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM12 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM13 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM14 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_WWDG
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI2
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI3
  *         @arg @ref LL_APB1_GRP1_PERIPH_OPAMP (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_COMP  (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART2
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART3
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART4 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART5 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C2
  *         @arg @ref LL_APB1_GRP1_PERIPH_I3C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_CRS
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART6 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART10 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART11 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_CEC (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART7 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART8 (*)
  *
  *  (*)  : Not available for all stm32h5xxxx family lines.
  * @retval State of Periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_APB1_GRP1_IsEnabledClock(uint32_t Periphs)
{
  return ((READ_BIT(RCC->APB1LENR, Periphs) == Periphs) ? 1UL : 0UL);
}

/**
  * @brief  Check if APB1 peripheral clock is enabled or not
  * @rmtoll APB1HENR     UART9EN       LL_APB1_GRP2_IsEnabledClock\n
  *         APB1HENR     UART12EN      LL_APB1_GRP2_IsEnabledClock\n
  *         APB1HENR     DTSEN         LL_APB1_GRP2_IsEnabledClock\n
  *         APB1HENR     LPTIM2EN      LL_APB1_GRP2_IsEnabledClock\n
  *         APB1HENR     FDCANEN       LL_APB1_GRP2_IsEnabledClock\n
  *         APB1HENR     UCPD1EN       LL_APB1_GRP2_IsEnabledClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP2_PERIPH_ALL
  *         @arg @ref LL_APB1_GRP2_PERIPH_UART9 (*)
  *         @arg @ref LL_APB1_GRP2_PERIPH_UART12 (*)
  *         @arg @ref LL_APB1_GRP2_PERIPH_DTS
  *         @arg @ref LL_APB1_GRP2_PERIPH_LPTIM2
  *         @arg @ref LL_APB1_GRP2_PERIPH_FDCAN
  *         @arg @ref LL_APB1_GRP2_PERIPH_UCPD1
  *
  *  (*)  : Not available for all stm32h5xxxx family lines.
  * @retval State of Periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_APB1_GRP2_IsEnabledClock(uint32_t Periphs)
{
  return ((READ_BIT(RCC->APB1HENR, Periphs) == Periphs) ? 1UL : 0UL);
}

/**
  * @brief  Disable APB1 peripherals clock.
  * @rmtoll APB1LENR     TIM2EN         LL_APB1_GRP1_DisableClock\n
  *         APB1LENR     TIM3EN         LL_APB1_GRP1_DisableClock\n
  *         APB1LENR     TIM4EN         LL_APB1_GRP1_DisableClock\n
  *         APB1LENR     TIM5EN         LL_APB1_GRP1_DisableClock\n
  *         APB1LENR     TIM6EN         LL_APB1_GRP1_DisableClock\n
  *         APB1LENR     TIM7EN         LL_APB1_GRP1_DisableClock\n
  *         APB1LENR     WWDGEN         LL_APB1_GRP1_DisableClock\n
  *         APB1LENR     SPI2EN         LL_APB1_GRP1_DisableClock\n
  *         APB1LENR     SPI3EN         LL_APB1_GRP1_DisableClock\n
  *         APB1LENR     USART2EN       LL_APB1_GRP1_DisableClock\n
  *         APB1LENR     USART3EN       LL_APB1_GRP1_DisableClock\n
  *         APB1LENR     UART4EN        LL_APB1_GRP1_DisableClock\n
  *         APB1LENR     UART5EN        LL_APB1_GRP1_DisableClock\n
  *         APB1LENR     I2C1EN         LL_APB1_GRP1_DisableClock\n
  *         APB1LENR     I2C2EN         LL_APB1_GRP1_DisableClock\n
  *         APB1LENR     I3C1EN         LL_APB1_GRP1_DisableClock\n
  *         APB1LENR     CRSEN          LL_APB1_GRP1_DisableClock\n
  *         APB1LENR     USART6EN       LL_APB1_GRP1_DisableClock\n
  *         APB1LENR     USART10EN      LL_APB1_GRP1_DisableClock\n
  *         APB1LENR     USART11EN      LL_APB1_GRP1_DisableClock\n
  *         APB1LENR     CECEN          LL_APB1_GRP1_DisableClock\n
  *         APB1LENR     UART7EN        LL_APB1_GRP1_DisableClock\n
  *         APB1LENR     UART8EN        LL_APB1_GRP1_DisableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM2
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM3
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM4 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM5 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM6
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM7
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM12 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM13 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM14 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_WWDG
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI2
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI3
  *         @arg @ref LL_APB1_GRP1_PERIPH_OPAMP (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_COMP  (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART2
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART3
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART4 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART5 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C2
  *         @arg @ref LL_APB1_GRP1_PERIPH_I3C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_CRS
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART6 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART10 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART11 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_CEC (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART7 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART8 (*)
  *
  *  (*)  : Not available for all stm32h5xxxx family lines.
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP1_DisableClock(uint32_t Periphs)
{
  CLEAR_BIT(RCC->APB1LENR, Periphs);
}

/**
  * @brief  Disable APB1 peripherals clock.
  * @rmtoll APB1HENR     UART9EN        LL_APB1_GRP2_DisableClock\n
  *         APB1HENR     UART12EN       LL_APB1_GRP2_DisableClock\n
  *         APB1HENR     DTSEN          LL_APB1_GRP2_DisableClock\n
  *         APB1HENR     LPTIM2EN       LL_APB1_GRP2_DisableClock\n
  *         APB1HENR     FDCANEN       LL_APB1_GRP2_DisableClock\n
  *         APB1HENR     UCPD1EN        LL_APB1_GRP2_DisableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP2_PERIPH_ALL
  *         @arg @ref LL_APB1_GRP2_PERIPH_UART9 (*)
  *         @arg @ref LL_APB1_GRP2_PERIPH_UART12 (*)
  *         @arg @ref LL_APB1_GRP2_PERIPH_DTS
  *         @arg @ref LL_APB1_GRP2_PERIPH_LPTIM2
  *         @arg @ref LL_APB1_GRP2_PERIPH_FDCAN
  *         @arg @ref LL_APB1_GRP2_PERIPH_UCPD1
  *
  *  (*)  : Not available for all stm32h5xxxx family lines.
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP2_DisableClock(uint32_t Periphs)
{
  CLEAR_BIT(RCC->APB1HENR, Periphs);
}

/**
  * @brief  Force APB1 peripherals reset.
  * @rmtoll APB1LRSTR     TIM2RST        LL_APB1_GRP1_ForceReset\n
  *         APB1LRSTR     TIM3RST        LL_APB1_GRP1_ForceReset\n
  *         APB1LRSTR     TIM4RST        LL_APB1_GRP1_ForceReset\n
  *         APB1LRSTR     TIM5RST        LL_APB1_GRP1_ForceReset\n
  *         APB1LRSTR     TIM6RST        LL_APB1_GRP1_ForceReset\n
  *         APB1LRSTR     TIM7RST        LL_APB1_GRP1_ForceReset\n
  *         APB1LRSTR     SPI2RST        LL_APB1_GRP1_ForceReset\n
  *         APB1LRSTR     SPI3RST        LL_APB1_GRP1_ForceReset\n
  *         APB1LRSTR     USART2RST      LL_APB1_GRP1_ForceReset\n
  *         APB1LRSTR     USART3RST      LL_APB1_GRP1_ForceReset\n
  *         APB1LRSTR     UART4RST       LL_APB1_GRP1_ForceReset\n
  *         APB1LRSTR     UART5RST       LL_APB1_GRP1_ForceReset\n
  *         APB1LRSTR     I2C1RST        LL_APB1_GRP1_ForceReset\n
  *         APB1LRSTR     I2C2RST        LL_APB1_GRP1_ForceReset\n
  *         APB1LRSTR     I3C1RST        LL_APB1_GRP1_ForceReset\n
  *         APB1LRSTR     CRSRST         LL_APB1_GRP1_ForceReset\n
  *         APB1LRSTR     USART6RST      LL_APB1_GRP1_ForceReset\n
  *         APB1LRSTR     USART10RST     LL_APB1_GRP1_ForceReset\n
  *         APB1LRSTR     USART11RST     LL_APB1_GRP1_ForceReset\n
  *         APB1LRSTR     CECRST         LL_APB1_GRP1_ForceReset\n
  *         APB1LRSTR     UART7RST       LL_APB1_GRP1_ForceReset\n
  *         APB1LRSTR     UART8RST       LL_APB1_GRP1_ForceReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM2
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM3
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM4 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM5 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM6
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM7
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM12 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM13 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM14 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI2
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI3
  *         @arg @ref LL_APB1_GRP1_PERIPH_OPAMP (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_COMP  (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART2
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART3
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART4 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART5 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C2
  *         @arg @ref LL_APB1_GRP1_PERIPH_I3C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_CRS
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART6 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART10 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART11 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_CEC (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART7 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART8 (*)
  *
  *  (*)  : Not available for all stm32h5xxxx family lines.
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP1_ForceReset(uint32_t Periphs)
{
  SET_BIT(RCC->APB1LRSTR, Periphs);
}

/**
  * @brief  Force APB1 peripherals reset.
  * @rmtoll APB1HRSTR     UART9RST       LL_APB1_GRP2_ForceReset\n
  *         APB1HRSTR     UART12RST      LL_APB1_GRP2_ForceReset\n
  *         APB1HRSTR     DTSRST         LL_APB1_GRP2_ForceReset\n
  *         APB1HRSTR     LPTIM2RST      LL_APB1_GRP2_ForceReset\n
  *         APB1HRSTR     FDCANRST       LL_APB1_GRP2_ForceReset\n
  *         APB1HRSTR     UCPD1RST       LL_APB1_GRP2_ForceReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP2_PERIPH_ALL
  *         @arg @ref LL_APB1_GRP2_PERIPH_UART9 (*)
  *         @arg @ref LL_APB1_GRP2_PERIPH_UART12 (*)
  *         @arg @ref LL_APB1_GRP2_PERIPH_DTS
  *         @arg @ref LL_APB1_GRP2_PERIPH_LPTIM2
  *         @arg @ref LL_APB1_GRP2_PERIPH_FDCAN
  *         @arg @ref LL_APB1_GRP2_PERIPH_UCPD1
  *
  *  (*)  : Not available for all stm32h5xxxx family lines.
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP2_ForceReset(uint32_t Periphs)
{
  SET_BIT(RCC->APB1HRSTR, Periphs);
}

